[
  {
    "sign": "Aries", "symbol": "♈", "element": "Fire", "quality": "Cardinal",
    "ruling_planet": { "traditional": "Mars", "modern": "Mars" },
    "archetypal_energy": "The Pioneer",
    "archetypal_description": "Brave, bold, and action-oriented. The initiator who leads the way into new territory. The warrior energy that faces challenges head-on.",
    "traditional_meaning": "Hot and dry in nature. Associated with leadership, courage, and direct action. The ram that charges forward without hesitation.",
    "modern_meaning": "Self-starter energy focused on identity, personal goals, and independent pursuits. Associated with assertiveness, confidence, and beginnings.",
    "shadow_aspects": "Impatience, selfishness, aggression, recklessness, and inability to follow through on projects.",
    "psychological_function": "Establishing individual identity and autonomy through direct action and self-assertion."
  },
  {
    "sign": "Taurus", "symbol": "♉", "element": "Earth", "quality": "Fixed",
    "ruling_planet": { "traditional": "Venus", "modern": "Venus" },
    "archetypal_energy": "The Builder",
    "archetypal_description": "Grounded, sensual, and resource-oriented. The sustainer who builds lasting structures and values stability and security.",
    "traditional_meaning": "Cold and dry in nature. Associated with fertility, resources, and physical pleasure. The bull that is strong, patient, and territorial.",
    "modern_meaning": "Security-focused energy oriented toward material resources, sensual experiences, and building solid foundations. Values persistence and reliability.",
    "shadow_aspects": "Stubbornness, possessiveness, materialism, resistance to change, and sensual overindulgence.",
    "psychological_function": "Establishing security and worth through the cultivation and management of resources and values."
  },
  {
    "sign": "Gemini", "symbol": "♊", "element": "Air", "quality": "Mutable",
    "ruling_planet": { "traditional": "Mercury", "modern": "Mercury" },
    "archetypal_energy": "The Messenger",
    "archetypal_description": "Curious, communicative, and intellectually versatile. The connector who bridges different ideas, people, and perspectives.",
    "traditional_meaning": "Hot and moist in nature. Associated with communication, trade, and duality. The twins representing versatility and adaptation.",
    "modern_meaning": "Communication-focused energy centered on information exchange, learning, and mental flexibility. Values intellectual stimulation and variety.",
    "shadow_aspects": "Superficiality, nervousness, inconsistency, scattered focus, and tendency to gossip.",
    "psychological_function": "Processing and exchanging information through communication, connection, and mental adaptability."
  },
  {
    "sign": "Cancer", "symbol": "♋", "element": "Water", "quality": "Cardinal",
    "ruling_planet": { "traditional": "Moon", "modern": "Moon" },
    "archetypal_energy": "The Nurturer",
    "archetypal_description": "Protective, emotionally sensitive, and caregiving. The maternal figure who creates safe spaces and emotional bonds.",
    "traditional_meaning": "Cold and moist in nature. Associated with home, family, and emotional security. The crab with hard shell and soft interior.",
    "modern_meaning": "Nurturing energy focused on emotional connections, family bonds, and creating safe spaces. Values emotional depth and security.",
    "shadow_aspects": "Moodiness, oversensitivity, clinginess, emotional manipulation, and difficulty with boundaries.",
    "psychological_function": "Creating emotional security through nurturing connections, intuitive awareness, and protective boundaries."
  },
  {
    "sign": "Leo", "symbol": "♌", "element": "Fire", "quality": "Fixed",
    "ruling_planet": { "traditional": "Sun", "modern": "Sun" },
    "archetypal_energy": "The Sovereign",
    "archetypal_description": "Creative, expressive, and magnanimous. The royal figure who radiates warmth and seeks recognition for authentic self-expression.",
    "traditional_meaning": "Hot and dry in nature. Associated with nobility, royalty, and creative power. The lion representing courage and dignity.",
    "modern_meaning": "Creative energy centered on self-expression, leadership, and playful enthusiasm. Values authenticity, recognition, and dramatic flair.",
    "shadow_aspects": "Arrogance, attention-seeking, domineering behavior, inflated ego, and dramatic overreactions.",
    "psychological_function": "Expressing authentic creativity and vitality through self-confidence, generosity, and heartfelt expression."
  },
  {
    "sign": "Virgo", "symbol": "♍", "element": "Earth", "quality": "Mutable",
    "ruling_planet": { "traditional": "Mercury", "modern": "Mercury" },
    "archetypal_energy": "The Analyst",
    "archetypal_description": "Precise, practical, and service-oriented. The craftsperson who refines, improves, and brings order to chaos through discernment.",
    "traditional_meaning": "Cold and dry in nature. Associated with harvest, health, and practical service. The virgin representing purity and discernment.",
    "modern_meaning": "Analytical energy focused on improvement, organization, and practical problem-solving. Values efficiency, precision, and usefulness.",
    "shadow_aspects": "Criticism, perfectionism, worry, overthinking, and excessive focus on flaws.",
    "psychological_function": "Refining and improving through discernment, analysis, and practical application of intelligence."
  },
  {
    "sign": "Libra", "symbol": "♎", "element": "Air", "quality": "Cardinal",
    "ruling_planet": { "traditional": "Venus", "modern": "Venus" },
    "archetypal_energy": "The Diplomat",
    "archetypal_description": "Harmonious, relationship-oriented, and fair-minded. The mediator who seeks balance and cooperates to create beauty and justice.",
    "traditional_meaning": "Hot and moist in nature. Associated with balance, harmony, and relationships. The scales representing justice and equilibrium.",
    "modern_meaning": "Relationship-focused energy centered on partnership, harmony, and social connection. Values fairness, beauty, and cooperation.",
    "shadow_aspects": "Indecisiveness, conflict avoidance, dependency on others, superficial charm, and passive-aggressiveness.",
    "psychological_function": "Balancing self and other through reciprocity, cooperation, and the pursuit of harmony and justice."
  },
  {
    "sign": "Scorpio", "symbol": "♏", "element": "Water", "quality": "Fixed",
    "ruling_planet": { "traditional": "Mars", "modern": "Pluto" },
    "archetypal_energy": "The Transformer",
    "archetypal_description": "Intense, profound, and transformative. The investigator who probes beneath surfaces to discover hidden truths and catalyze change.",
    "traditional_meaning": "Cold and moist in nature. Associated with death, rebirth, and shared resources. The scorpion representing power and intensity.",
    "modern_meaning": "Transformative energy focused on emotional depth, psychological insight, and regenerative power. Values authenticity, intensity, and intimacy.",
    "shadow_aspects": "Manipulation, jealousy, vengefulness, obsession, and emotional extremes.",
    "psychological_function": "Transforming through emotional intensity, psychological depth, and the integration of shadow material."
  },
  {
    "sign": "Sagittarius", "symbol": "♐", "element": "Fire", "quality": "Mutable",
    "ruling_planet": { "traditional": "Jupiter", "modern": "Jupiter" },
    "archetypal_energy": "The Explorer",
    "archetypal_description": "Adventurous, philosophical, and freedom-loving. The seeker who expands horizons through travel, education, and belief systems.",
    "traditional_meaning": "Hot and dry in nature. Associated with religion, higher learning, and long journeys. The archer aiming for distant targets.",
    "modern_meaning": "Expansive energy focused on exploration, knowledge, and optimistic possibilities. Values freedom, truth, and broad perspectives.",
    "shadow_aspects": "Overconfidence, exaggeration, dogmatism, restlessness, and avoidance of commitments.",
    "psychological_function": "Expanding consciousness through exploration, meaning-making, and belief in greater possibilities."
  },
  {
    "sign": "Capricorn", "symbol": "♑", "element": "Earth", "quality": "Cardinal",
    "ruling_planet": { "traditional": "Saturn", "modern": "Saturn" },
    "archetypal_energy": "The Authority",
    "archetypal_description": "Disciplined, ambitious, and structured. The manager who builds lasting systems through patience, integrity, and strategic thinking.",
    "traditional_meaning": "Cold and dry in nature. Associated with time, social structures, and achievement. The mountain goat climbing steadily upward.",
    "modern_meaning": "Authoritative energy focused on achievement, responsibility, and social contribution. Values structure, discipline, and enduring legacy.",
    "shadow_aspects": "Rigidity, status-seeking, pessimism, emotional suppression, and workaholism.",
    "psychological_function": "Establishing structure and mastery through discipline, responsibility, and the setting of appropriate boundaries."
  },
  {
    "sign": "Aquarius", "symbol": "♒", "element": "Air", "quality": "Fixed",
    "ruling_planet": { "traditional": "Saturn", "modern": "Uranus" },
    "archetypal_energy": "The Visionary",
    "archetypal_description": "Innovative, humanitarian, and independent. The reformer who envisions new possibilities for society through detached observation.",
    "traditional_meaning": "Hot and moist in nature. Associated with groups, collective knowledge, and innovation. The water-bearer distributing wisdom.",
    "modern_meaning": "Revolutionary energy focused on social progress, intellectual freedom, and collective ideals. Values originality, equality, and future-oriented thinking.",
    "shadow_aspects": "Emotional detachment, rebellion for its own sake, eccentricity, impracticality, and intellectual arrogance.",
    "psychological_function": "Innovating through detached perspective, intellectual freedom, and collaborative social exchange."
  },
  {
    "sign": "Pisces", "symbol": "♓", "element": "Water", "quality": "Mutable",
    "ruling_planet": { "traditional": "Jupiter", "modern": "Neptune" },
    "archetypal_energy": "The Mystic",
    "archetypal_description": "Compassionate, intuitive, and receptive. The dreamer who dissolves boundaries through empathy, imagination, and spiritual connection.",
    "traditional_meaning": "Cold and moist in nature. Associated with surrender, hidden knowledge, and collective unconscious. The two fish swimming in opposite directions.",
    "modern_meaning": "Transcendent energy focused on compassion, intuition, and spiritual unity. Values empathy, imagination, and flow with life's currents.",
    "shadow_aspects": "Escapism, martyrdom, delusion, boundary confusion, and emotional overwhelm.",
    "psychological_function": "Transcending limitations through compassion, imagination, and connection to the collective unconscious."
  }
]
